---
kind: type
id: T:Autodesk.Revit.UI.Events.SelectionChangedEventArgs
source: html/8a744513-6de0-de55-c44c-bba00b949863.htm
---
# Autodesk.Revit.UI.Events.SelectionChangedEventArgs

The event arguments used by the SelectionChanged event.

## Syntax (C#)
```csharp
public class SelectionChangedEventArgs : RevitAPISingleEventArgs
```